#include<iostream>
using namespace std;
#include<stdint.h>    //头文件包含需要 


int test(uint32_t n )
{
	int count=0;
//	while(n)
//	{
//		n=n&(n-1)   //这是第一种办法就是我们如果相邻两个与的结果就相当于减去了一个1
//					//比如1000111&1000110=1000110    1000110&1000101=1000100 以此
//					//以此来统计1的个数 
//		count++;
//	}
	while(n!=0)
	{
		if(n&1)   //1就是00000..1然后与以下就可以判断最后一位是不是1,然后再右移把最后一位删掉，再判断 
			count++;
		n>>=1;     //<<左移就是把右边空出来一个位置，比如01  左移就是 010,右移就是去掉最后
				//最后一位，101101->10110 
	}
	return count;
 } 
 int main()
 {
 	uint32_t n=0000000000000000000000000001011; 
 	cout<<test(n);
 }
